#include "const.h"

int main()
{
    // 1. GPIOピンの機能選択
    // 111を27から29ビットのところに置き、それを、反転(~ not)させる。
    // それを、and演算でくっつけることで、他のピンの設定はそのまま保護した状態で書き換えれる
    // 最後に、010を27ビットから29ビット目にor演算で足してピンの設定を行う
    *GPFSEL1 = (*GPFSEL1 & ~(7 << 27)) | (2 << 27);

    // 2. クロックソースの設定(講義資料より)
    // 2. クロックソースの設定
    *CM_PWMCTL = 0x5a000021; // src=osc, enable=false
    while (*CM_PWMCTL & 0x80)
        ;                              // busyビット(7ビット目)がクリアされるまで確実に待つ
    *CM_PWMDIV = 0x5a000000 | 2 << 12; // div=2.0
    *CM_PWMCTL = 0x5a000211;           // src=osc, enable=true

    // 3. PWMの動作モード設定
    // 8ビット目を1にして、動作開始に
    // 15ビット目を1にしてM/S転送モードに
    *PWM_CTL = (1 << 15) | (1 << 8);

    // ラの音を鳴らす
    *PWM_RNG2 = KEY_A4;     // 周期
    *PWM_DAT2 = KEY_A4 / 2; // 周期の半分

    return 0;
}